
#Надеюсь, я правильно понял смысл "нумерации с 0". В данном случае, нулевой это 0,
# первый это 0, второй это 1, третий это 1, четвертый это уже 2 итд

#Но если все же неправильно, то закомментированный код это для нумерации с 0 уже для
# вычисляемых чисел (0 это 1, 1 это 2, 2 это 4)
def tribonachi(n):

    # if n < 0: return 0
    # if n in (0,1): return 1

    if n <= 1: return 0
    if n == 2:
        return 1
    return tribonachi(n-1) + tribonachi(n-2) + tribonachi(n-3)

print(tribonachi(7))